## read the csv file and find correlation between columns/features/variables using df.corr()

## import the required packages

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
## read the data
df=pd.read_csv("Salary_Data.csv")

In [7]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [8]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 660.0 bytes

In [15]:
#  Correlation , to see whether columns are related
corr = df.corr()

In [16]:
corr

                 YearsExperience    Salary
YearsExperience         1.000000  0.983642
Salary                  0.983642  1.000000

In [13]:
corr.style.background_gradient(cmap='berlin')

In [14]:
corr.style.background_gradient(cmap='vanimo')

In [17]:
corr.style.background_gradient(cmap='Spectral')